{"backend": "tensorflow", "config": [{"config": {"trainable": true, "units": 128, "stateful": false, "activation": "tanh", "kernel_constraint": null, "recurrent_constraint": null, "recurrent_regularizer": null, "batch_input_shape": [null, 8, 52], "implementation": 0, "activity_regularizer": null, "name": "lstm_1", "recurrent_dropout": 0.0, "return_state": false, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "unroll": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "unit_forget_bias": true, "dtype": "float32", "kernel_regularizer": null, "go_backwards": false, "return_sequences": false, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dropout": 0.0, "recurrent_activation": "hard_sigmoid"}, "class_name": "LSTM"}, {"config": {"bias_regularizer": null, "trainable": true, "units": 52, "bias_constraint": null, "use_bias": true, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "name": "dense_1", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"activation": "softmax", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "2.0.6"}